$(document).ready(function () {
    var o_kpp = [],
        o_inn = [],
        o_oktmo = [],
        o_numb = [],
        o_bank = [],
        adr =  [],
        dinner = [];

    o_kpp[3] = "771601001";
    o_inn[3] = "7716103458";
    o_oktmo[3] = "45351000";
    o_numb[3] = "40101810800000010041";
    o_bank[3] = "Отделение 1 Москва";
    adr[3] = "ул. Маршала Савицкого, 2, Москва, Россия, 117148";
    dinner[3] = "с 13.00 до 14.00";



    o_kpp[5] = "770801001";
    o_inn[5] = "7708034472";
    o_oktmo[5] = "45378000";
    o_numb[5] = "40101810800000010041";
    o_bank[5] = "Отделение 1 Москва";
    adr[5] = "Каланчевская ул., 11, Москва, Россия, 107078";
    dinner[5] = "с 13.00 до 13.45";

    o_kpp[4] = "771501001";
    o_inn[4] = "7713034630";
    o_oktmo[4] = "45346000";
    o_numb[4] = "40101810800000010041";
    o_bank[4] = "УФК МФ РФ по г. Москве";
    adr[4] = "ул. Образцова, 26, Москва, Россия, 127018";
    dinner[4] = "с 13.00 до 14.00";

    o_kpp[2] = "770601001";
    o_inn[2] = "7706044740";
    o_oktmo[2] = "45384000";
    o_numb[2] = "40101810800000010041";
    o_bank[2] = "УФК МФ РФ по г. Москве";
    adr[2] = "ул. Донская, 11c1, Москва, Россия, 119049";
    dinner[2] = "с 13.00 до 13.45";

    o_kpp[1] = "774301001";
    o_inn[1] = "7743777777";
    o_oktmo[1] = "45341000";
    o_numb[1] = "40101810800000010041";
    o_bank[1] = "УФК МФ РФ по г. Москве";
    adr[1] = "Зои и Александра Космодемьянских ул., 31к2, Москва, Россия, 125130";
    dinner[1] = "с 13.00 до 14.00";

    o_kpp[6] = "773001001";
    o_inn[6] = "7730057570";
    o_oktmo[6] = "45318000";
    o_numb[6] = "40101810800000010041";
    o_bank[6] = "УФК МФ РФ по г. Москве";
    adr[6] = "Студенческая ул., 36, Москва, Россия, 121165";
    dinner[6] = "с 13.00 до 14.00";

    o_kpp[7] = "770501001";
    o_inn[7] = "7705045236";
    o_oktmo[7] = "45376000";
    o_numb[7] = "40101810800000010041";
    o_bank[7] = "УФК МФ РФ по г. Москве";
    adr[7] = "Татарская ул., 1, Москва, Россия, 115184";
    dinner[7] = "с 13.00 до 14.00";

    o_kpp[8] = "773501001";
    o_inn[8] = "7735071603";
    o_oktmo[8] = "45330000";
    o_numb[8] = "40101810800000010041";
    o_bank[8] = "УФК МФ РФ по г. Москве";
    adr[8] = "Зеленоград, Москва, Россия, 124365";
    dinner[8] = "с 13.00 до 14.00";

    o_kpp[9] = "772701001";
    o_inn[9] = "7727092173";
    o_oktmo[9] = "45397000";
    o_numb[9] = "40101810800000010041";
    o_bank[9] = "УФК МФ РФ по г. Москве";
    adr[9] = "ул. Кржижановского, 20/30, корп. 4, Москва, Россия, 117218";
    dinner[9] = "с 13.00 до 14.45";

    o_kpp[10] = "770901001";
    o_inn[10] = "7701107259";
    o_oktmo[10] = "45375000";
    o_numb[10] = "40101810800000010041";
    o_bank[10] = "Отделение 1 Москва";
    adr[10] = "ул. Первомайская, 12, Москва, Россия, 105037";
    dinner[10] = "с 13.00 до 14.00";

    o_kpp[11] = "774301001";
    o_inn[11] = "7743777777";
    o_oktmo[11] = "45341000";
    o_numb[11] = "40101810800000010041";
    o_bank[11] = "УФК МФ РФ по г. Москве";
    adr[11] = "Зои и Александра Космодемьянских ул., 31, к. 2, Москва, Россия, 125130";
    dinner[11] = "с 13.00 до 14.00";

    o_kpp[12] = "772101001";
    o_inn[12] = "7721049904";
    o_oktmo[12] = "45394000";
    o_numb[12] = "40101810800000010041";
    o_bank[12] = "Отделение 1 Москва";
    adr[12] = "ул. Зеленодольская, 8/13, Москва, Россия, 109377";
    dinner[12] = "с 13.00 до 13.45";

    o_kpp[13] = "773101001";
    o_inn[13] = "7731154880";
    o_oktmo[13] = "45320000";
    o_numb[13] = "40101810800000010041";
    o_bank[13] = "УФК МФ РФ по г. Москве";
    adr[13] = "Ярцевская ул., 12, Москва, Россия, 121351";
    dinner[13] = "с 13.00 до 13.45";

    o_kpp[14] = "772201001";
    o_inn[14] = "7709000010";
    o_oktmo[14] = "45381000";
    o_numb[14] = "40101810800000010041";
    o_bank[14] = "УФК МФ РФ по г. Москве";
    adr[14] = "Андроньевская пл., 5/9, Москва, Россия, 105120";
    dinner[14] = "с 13.00 до 14.00";

    o_kpp[16] = "772301001";
    o_inn[16] = "7723013452";
    o_oktmo[16] = "45389000";
    o_numb[16] = "40101810800000010041";
    o_bank[16] = "УФК МФ РФ по г. Москве";
    adr[16] = "ул. Марьинский Парк, 29, Москва, Россия, 109559";
    dinner[16] = "с 13.00 до 13.45";

    o_kpp[15] = "770801001";
    o_inn[15] = "7708034472";
    o_oktmo[15] = "45378000";
    o_numb[15] = "40101810800000010041";
    o_bank[15] = "Отделение 1 Москва";
    adr[15] = "ул. Фридриха Энгельса, 32, стр.1, Москва, Россия, 129090";
    dinner[15] = "с 13.00 до 14.00";

    o_kpp[17] = "772401001";
    o_inn[17] = "7724111558";
    o_oktmo[17] = "45918000";
    o_numb[17] = "40101810800000010041";
    o_bank[17] = "УФК МФ РФ по г. Москве";
    adr[17] = "Каширский пр-д, 3, Москва, Россия, 115201";
    dinner[17] = "с 13.00 до 14.00";

    o_kpp[18] = "772901001";
    o_inn[18] = "7729150007";
    o_oktmo[18] = "45325000";
    o_numb[18] = "40101810800000010041";
    o_bank[18] = "УФК МФ РФ по г. Москве";
    adr[18] = "Мичуринский пр., 17, корпус 1, Москва, Россия, 119192";
    dinner[18] = "с 13.00 до 13.45";

    o_kpp[19] = "771701001";
    o_inn[19] = "7717018935";
    o_oktmo[19] = "45358000";
    o_numb[19] = "40101810800000010041";
    o_bank[19] = "Отделение 1 Москва";
    adr[19] = "1-я Останкинская ул., 35, Москва, Россия, 129515";
    dinner[19] = "с 13.00 до 14.00";

    o_kpp[20] = "772001001";
    o_inn[20] = "7720143220";
    o_oktmo[20] = "45312000";
    o_numb[20] = "40101810800000010041";
    o_bank[20] = "Отделение 1 Москва";
    adr[20] = "Кусковская ул., 8, стр. 1, Москва, Россия, 111398";
    dinner[20] = "с 13.00 до 14.00";

    o_kpp[21] = "771801001";
    o_inn[21] = "7718111790";
    o_oktmo[21] = "45316000";
    o_numb[21] = "40101810800000010041";
    o_bank[21] = "Отделение 1 Москва";
    adr[21] = "2-я Бухвостова ул., вл4, Москва, Россия, 107076";
    dinner[21] = " с 13.00 до 13.45";

    o_kpp[22] = "770301001";
    o_inn[22] = "7703037470";
    o_oktmo[22] = "45380000";
    o_numb[22] = "40101810800000010041";
    o_bank[22] = "УФК МФ РФ по г. Москве";
    adr[22] = "Зоологическая ул., 20, Москва, Россия, 123242";
    dinner[22] = "с 13.00 до 14.00";

    o_kpp[23] = "771001001";
    o_inn[23] = "7710047253";
    o_oktmo[23] = "45382000";
    o_numb[23] = "40101810800000010041";
    o_bank[23] = "УФК МФ РФ по г. Москве";
    adr[23] = "Бутырский Вал ул., 7, Москва, Россия, 127055";
    dinner[23] = "с 13.00 до 14.00";

    o_kpp[24] = "772501001";
    o_inn[24] = "7725068979";
    o_oktmo[24] = "45914000";
    o_numb[24] = "40101810800000010041";
    o_bank[24] = "Отделение 1 Москва";
    adr[24] = "Восточная ул., 2, стр. 6, Москва, Россия, 115280";
    dinner[24] = "с 13.00 до 14.00";

    o_kpp[25] = "772501001";
    o_inn[25] = "7725068979";
    o_oktmo[25] = "45914000";
    o_numb[25] = "40101810800000010041";
    o_bank[25] = "Отделение 1 Москва";
    adr[25] = "ул. 50 лет Октября, 6 корпус 1, Москва, Россия, 119618";
    dinner[25] = "с 13.00 до 14.00";

    o_kpp[26] = "772901001";
    o_inn[26] = "7729150007";
    o_oktmo[26] = "45326000";
    o_numb[26] = "40101810800000010041";
    o_bank[26] = "Отделение 1 Москва";
    adr[26] = "Марксистский пер., 1/32, Москва, Россия, 109147";
    dinner[26] = "с 13.00 до 14.00";

    o_kpp[27] = "770901001";
    o_inn[27] = "7709000010";
    o_oktmo[27] = "45381000";
    o_numb[27] = "40101810800000010041";
    o_bank[27] = "УФК МФ РФ по г. Москве";
    adr[27] = "Цветной б-р, 25А, Москва, Россия, 127051";
    dinner[27] = "с 13.00 до 14.00";

    o_kpp[28] = "771301001";
    o_inn[28] = "7713034630";
    o_oktmo[28] = "45346000";
    o_numb[28] = "40101810800000010041";
    o_bank[28] = "Отделение 1 Москва";
    adr[28] = "Дмитровское ш., 65, Москва, Россия, 127238";
    dinner[28] = "с 13.00 до 14.00";

    o_kpp[29] = "773301001";
    o_inn[29] = "7733053334";
    o_oktmo[29] = "45368000";
    o_numb[29] = "40101810800000010041";
    o_bank[29] = "УФК МФ РФ по г. Москве";
    adr[29] = "улица Героев Панфиловцев, 26, к. 1, Москва, Россия, 125373";
    dinner[29] = "с 13.00 до 14.00";

    o_kpp[31] = "770401001";
    o_inn[31] = "7704058987";
    o_oktmo[31] = "45383000";
    o_numb[31] = "40101810800000010041";
    o_bank[31] = "УФК МФ РФ по г. Москве";
    adr[31] = "7-й Ростовский пер., 21, Москва, Россия, 119121";
    dinner[31] = "с 13.00 до 14.00";

    o_kpp[32] = "773401001";
    o_inn[32] = "7734110842";
    o_oktmo[32] = "45371000";
    o_numb[32] = "40101810800000010041";
    o_bank[32] = "УФК МФ РФ по г. Москве";
    adr[32] = "ул. Маршала Тухачевского, 25к1, Москва, Россия, 123154";
    dinner[32] = "с 13.00 до 14.00";

    o_kpp[30] = "772701001";
    o_inn[30] = "7727092173";
    o_oktmo[30] = "45397000";
    o_numb[30] = "40101810800000010041";
    o_bank[30] = "УФК МФ РФ по г. Москве";
    adr[30] = "ул. Кржижановского, 20/30, к.3, Москва, Россия, 117218";
    dinner[30] = "с 13.00 до 14.00";

    o_kpp[33] = "772601001";
    o_inn[33] = "7726062105";
    o_oktmo[33] = "45920000";
    o_numb[33] = "40101810800000010041";
    o_bank[33] = "УФК МФ РФ по г. Москве";
    adr[33] = "Артековская ул., 3А, Москва, Россия, 117556";
    dinner[33] = "с 13.00 до 14.00";

    o_kpp[34] = "772401001";
    o_inn[34] = "7724111558";
    o_oktmo[34] = "45918000";
    o_numb[34] = "40101810800000010041";
    o_bank[34] = "Отделение 1 Москва";
    adr[34] = "ул. Маршала Савицкого, 2, Москва, Россия, 117148";
    dinner[34] = "с 13.00 до 14.00";

    var d = new Date(),
        day = d.getDate(),
        m = d.getMonth()+1,
        month = m < 10 ? '0' + m : m;
        year = d.getFullYear(),
        myDate = day + "." + month + "." + year + " г.";

    $('.js-select').on('change', function () {
        var v = $('.js-select').val();

        $('#o_kpp').val(o_kpp[v]);
        $('#o_inn').val(o_inn[v]);
        $('#o_oktmo').val(o_oktmo[v]);
        $('#o_numb').val(o_numb[v]);
        $('#o_bank').val(o_bank[v]);
        $('#o_date').val(myDate);
    });

    var s_map = $('.js-map'),
        s_count = $('.js-count'),
        s_adr = $('.js-adr');

    $('.js-sel').on('change', function () {
        var v = $('.js-sel').val()
            lastLi = $('.count_schedule-day ul li:last-child p');
        if(v > 0) {
            s_map.fadeIn(1000);
            s_count.fadeIn(1000);
            s_adr.fadeIn(1000);

            $('.js-adr span').text(adr[v]);
            lastLi.text(dinner[v]);

        } else {
            s_map.fadeOut(500);
            s_count.fadeOut(500);
            s_adr.fadeOut(500);
            $('.t_map').css('display', 'none');
        }

        $('[data-count]').each(function() {
            var el = $(this);

            if(el.attr('data-count') === v) {
                $(this).addClass('a');
            } else {
               el.removeClass('a');
            }

        });

    });



});